# BritishThermalUnitsPerDegreeFahrenheit Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..BritishThermalUnitsPerDegreeFahrenheit Property
UnitTypeId Class See Also
---
British thermal units per degree Fahrenheit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId BritishThermalUnitsPerDegreeFahrenheit { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BritishThermalUnitsPerDegreeFahrenheit As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BritishThermalUnitsPerDegreeFahrenheit {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace